benchmark/results/apache.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        Apache/2.4.66
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /
Document Length:        554 bytes

Concurrency Level:      10
Time taken for tests:   0.228 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      825000 bytes
HTML transferred:       554000 bytes
Requests per second:    4377.40 [#/sec] (mean)
Time per request:       2.284 [ms] (mean)
Time per request:       0.228 [ms] (mean, across all concurrent requests)
Transfer rate:          3526.72 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.4      1       5
Processing:     0    1   0.6      1       6
Waiting:        0    1   0.4      1       4
Total:          1    2   0.8      2       7

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      2
  80%      2
  90%      3
  95%      3
  98%      5
  99%      6
 100%      7 (longest request)