benchmark/results/apache.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        Apache/2.4.66
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /
Document Length:        554 bytes

Concurrency Level:      100
Time taken for tests:   2.335 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      8250000 bytes
HTML transferred:       5540000 bytes
Requests per second:    4282.99 [#/sec] (mean)
Time per request:       23.348 [ms] (mean)
Time per request:       0.233 [ms] (mean, across all concurrent requests)
Transfer rate:          3450.65 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   10   3.3     10      32
Processing:     4   13   6.0     12     118
Waiting:        1   10   5.2      9     114
Total:          5   23   6.5     22     136

Percentage of the requests served within a certain time (ms)
  50%     22
  66%     24
  75%     25
  80%     25
  90%     28
  95%     33
  98%     43
  99%     52
 100%    136 (longest request)