benchmark/results/apache.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        Apache/2.4.66
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /
Document Length:        554 bytes

Concurrency Level:      50
Time taken for tests:   0.771 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      4125000 bytes
HTML transferred:       2770000 bytes
Requests per second:    6485.98 [#/sec] (mean)
Time per request:       7.709 [ms] (mean)
Time per request:       0.154 [ms] (mean, across all concurrent requests)
Transfer rate:          5225.52 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   0.5      3       6
Processing:     1    4   0.8      4      10
Waiting:        1    3   0.8      3       9
Total:          3    8   0.9      8      13

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      8
  75%      8
  80%      8
  90%      9
  95%      9
  98%     10
  99%     10
 100%     13 (longest request)