benchmark/results/apache.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        Apache/2.4.66
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /
Document Length:        554 bytes

Concurrency Level:      10
Time taken for tests:   0.182 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      825000 bytes
HTML transferred:       554000 bytes
Requests per second:    5496.17 [#/sec] (mean)
Time per request:       1.819 [ms] (mean)
Time per request:       0.182 [ms] (mean, across all concurrent requests)
Transfer rate:          4428.06 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.2      1       2
Processing:     0    1   0.2      1       3
Waiting:        0    1   0.2      1       1
Total:          1    2   0.3      2       3

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      2
  80%      2
  90%      2
  95%      2
  98%      2
  99%      3
 100%      3 (longest request)