benchmark/results/custom.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /
Document Length:        554 bytes

Concurrency Level:      100
Time taken for tests:   29.053 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      6380000 bytes
HTML transferred:       5540000 bytes
Requests per second:    344.20 [#/sec] (mean)
Time per request:       290.530 [ms] (mean)
Time per request:       2.905 [ms] (mean, across all concurrent requests)
Transfer rate:          214.45 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       7
Processing:     4  289  30.7    281     404
Waiting:        2  288  30.7    280     403
Total:         11  289  30.5    281     404

Percentage of the requests served within a certain time (ms)
  50%    281
  66%    292
  75%    301
  80%    306
  90%    328
  95%    341
  98%    372
  99%    396
 100%    404 (longest request)