benchmark/results/custom.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /
Document Length:        554 bytes

Concurrency Level:      10
Time taken for tests:   0.443 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      638000 bytes
HTML transferred:       554000 bytes
Requests per second:    2256.63 [#/sec] (mean)
Time per request:       4.431 [ms] (mean)
Time per request:       0.443 [ms] (mean, across all concurrent requests)
Transfer rate:          1405.99 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       3
Processing:     2    4   0.9      4       8
Waiting:        1    3   0.8      3       6
Total:          2    4   0.9      4       8

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      5
  75%      5
  80%      5
  90%      5
  95%      6
  98%      6
  99%      7
 100%      8 (longest request)