benchmark/results/custom.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /
Document Length:        554 bytes

Concurrency Level:      50
Time taken for tests:   2.737 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      3190000 bytes
HTML transferred:       2770000 bytes
Requests per second:    1827.15 [#/sec] (mean)
Time per request:       27.365 [ms] (mean)
Time per request:       0.547 [ms] (mean, across all concurrent requests)
Transfer rate:          1138.40 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   11 112.4      0    2053
Processing:     2   13  98.4      7    1704
Waiting:        1   12  98.4      6    1703
Total:          2   25 188.8      7    2729

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      7
  75%      8
  80%      8
  90%      9
  95%      9
  98%     11
  99%   1015
 100%   2729 (longest request)