benchmark/results/custom.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /
Document Length:        554 bytes

Concurrency Level:      10
Time taken for tests:   0.595 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      638000 bytes
HTML transferred:       554000 bytes
Requests per second:    1680.03 [#/sec] (mean)
Time per request:       5.952 [ms] (mean)
Time per request:       0.595 [ms] (mean, across all concurrent requests)
Transfer rate:          1046.74 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       2
Processing:     2    5   1.4      5      12
Waiting:        1    4   1.2      4      10
Total:          2    6   1.5      6      12

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      6
  75%      7
  80%      7
  90%      8
  95%      8
  98%      9
  99%     10
 100%     12 (longest request)