benchmark/results/nginx.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        nginx/1.28.3
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /
Document Length:        554 bytes

Concurrency Level:      50
Time taken for tests:   0.612 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      3980000 bytes
HTML transferred:       2770000 bytes
Requests per second:    8170.17 [#/sec] (mean)
Time per request:       6.120 [ms] (mean)
Time per request:       0.122 [ms] (mean, across all concurrent requests)
Transfer rate:          6351.03 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   0.7      3       5
Processing:     1    3   1.1      3      10
Waiting:        1    2   1.0      2       9
Total:          2    6   1.0      6      14

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      6
  75%      6
  80%      7
  90%      7
  95%      8
  98%      9
  99%     10
 100%     14 (longest request)