benchmark/results/nginx.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        nginx/1.28.3
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /
Document Length:        554 bytes

Concurrency Level:      100
Time taken for tests:   1.474 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      7960000 bytes
HTML transferred:       5540000 bytes
Requests per second:    6784.28 [#/sec] (mean)
Time per request:       14.740 [ms] (mean)
Time per request:       0.147 [ms] (mean, across all concurrent requests)
Transfer rate:          5273.72 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    7   1.9      7      16
Processing:     1    8   2.0      8      18
Waiting:        1    5   2.0      5      13
Total:          9   15   1.8     14      25

Percentage of the requests served within a certain time (ms)
  50%     14
  66%     15
  75%     15
  80%     16
  90%     17
  95%     18
  98%     19
  99%     21
 100%     25 (longest request)